#include "esp_01s.h"

uint8_t esp01s_RxData[64];
uint8_t esp_char;

/*
*********************************************************************************************************
*	ï¿½ï¿½ ï¿½ï¿½ ï¿½ï¿½: bsp_esp01s_Init
*	ï¿½ï¿½ï¿½ï¿½Ëµï¿½ï¿½: bsp_esp01s_Initï¿½ï¿½ï¿½ï¿½ï¿½Ó¿Ú³ï¿½Ê¼ï¿½ï¿½
*	ï¿½ï¿½    ï¿½ï¿½: ï¿½ï¿½
*	ï¿½ï¿½ ï¿½ï¿½ Öµ: ï¿½ï¿½
*   ï¿½ï¿½    ×¢ï¿½ï¿½
*********************************************************************************************************
*/
void bsp_esp01s_Init(void)
{
    // BSP_UART1 = ESP_01S;
    BSP_UART1.UART1_RxReceive = esp_01s_RxData;
    BSP_UART1.UART1_TxSend = esp_01s_TxData;
    HAL_UART_Receive_DMA(&huart1, &esp_char, 1);
}
/*
*********************************************************************************************************
*	ï¿½ï¿½ ï¿½ï¿½ ï¿½ï¿½: esp01s_Init
*	ï¿½ï¿½ï¿½ï¿½Ëµï¿½ï¿½: esp_01sï¿½Ïµï¿½ï¿½Ê¼ï¿½ï¿½
*	ï¿½ï¿½    ï¿½ï¿½: ï¿½ï¿½
*	ï¿½ï¿½ ï¿½ï¿½ Öµ: ï¿½ï¿½
*   ï¿½ï¿½    ×¢ï¿½ï¿½
*********************************************************************************************************
*/

HAL_StatusTypeDef esp_01s_Init(void)
{

    //    esp_01s_TxData("AT\r\n",strlen("AT\r\n"));
    //    delay_ms(1000);
    //    esp_01s_TxData("AT+CWMODE=2\r\n",strlen("AT+CWMODE=2\r\n"));
    //    delay_ms(1000);
    //    esp_01s_TxData("AT+CWJAP=\"TP-LINK_3E30\",\"18650711783\"\r\n",strlen("AT+CWJAP=\"TP-LINK_3E30\",\"18650711783\"\r\n"));
    //    delay_ms(1000);
    esp_01s_TxData("AT+CIPMUX=1\r\n", strlen("AT+CIPMUX=1\r\n")); // ï¿½Ïµï¿½ï¿½ï¿½Òªï¿½ï¿½ï¿½Â·ï¿½ï¿½ï¿½Ö¸ï¿½ï¿½ï¿½ï¿½Ö»ï¿½ï¿½ï¿½ï¿½Ó¶Ë¿ï¿½
    delay_ms(100);
    esp_01s_TxData("AT+CIPSERVER=1,8080\r\n", strlen("AT+CIPSERVER=1,8080\r\n")); // ï¿½Ö»ï¿½ï¿½ï¿½ï¿½Ó¶Ë¿ï¿½ï¿½ï¿½ï¿½ï¿½
    //    delay_ms(1000);
    //    esp_01s_TxData("AT+CIFSR\r\n",strlen("AT+CIFSR\r\n"));
    //    delay_ms(1000);
    //    if(strcmp(esp01s_RxData, "OK") != 0)
    //      return HAL_ERROR;

    return HAL_OK;
}

/*
*********************************************************************************************************
*	ï¿½ï¿½ ï¿½ï¿½ ï¿½ï¿½: esp_01s_TxData
*	ï¿½ï¿½ï¿½ï¿½Ëµï¿½ï¿½: esp_01sï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
*	ï¿½ï¿½    ï¿½ï¿½: ï¿½ï¿½
*	ï¿½ï¿½ ï¿½ï¿½ Öµ: ï¿½ï¿½
*   ï¿½ï¿½    ×¢ï¿½ï¿½
*********************************************************************************************************
*/
void esp_01s_TxData(uint8_t *_DataBuf, uint32_t _Len)
{
    HAL_UART_Transmit_DMA(&huart1, _DataBuf, _Len);
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: 
*	¹¦ÄÜËµÃ÷: 
*	ÐÎ    ²Î: 
*	·µ »Ø Öµ: 
*   ±¸    ×¢£º
*********************************************************************************************************
*/
void esp_01s_RxData(void)
{
    static uint8_t i = 0;
    if (esp_char != '\n')
    {
        esp01s_RxData[i] = esp_char;
        i++;
    }
    else
    {
        ParsingEsp01sMsg_test(esp01s_RxData, i);
        i = 0;
    }
    HAL_UART_Receive_DMA(&huart1, &esp_char, 1);
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: 
*	¹¦ÄÜËµÃ÷: 
*	ÐÎ    ²Î: 
*	·µ »Ø Öµ: 
*   ±¸    ×¢£º
*********************************************************************************************************
*/
#define esp_cmd data[0]
void ParsingEsp01sMsg_test(uint8_t *data, uint32_t lenth)
{
    if (esp_cmd == '1')
    {
        esp_01s_TxData("111", 3);
    }
    else if (esp_cmd == '2')
    {
        esp_01s_TxData("222", 3);
    }
    else if (esp_cmd == '3')
    {
        esp_01s_TxData("333", 3);
    }
}